<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
		<meta name="keywords" content="Lernkartei, Vokabeltrainer, Fremdsprachen, Redewendungen, Vokabeln">
		<meta name="description" content="Die Lernkartei ist ein kostenlos nutzbarer Vokabeltrainer f&uuml;r Windows, Linux und MAC, der in Java programmiert wurde. Die Lernkartei hilft dir beim &Uuml;ben von Vokabeln und Redewendungen in Fremdsprachen und funktioniert genauso, wie sein Gegenst&uuml;ck aus Karton mit den Karteik&auml;rtchen.">
		<meta name="author" content="Hanspeter Hochreutener">		
    <title>Lernkartei-Hilfe</title>
  </head>
  <body>
    <h1>Lernkartei - Bedienung</h1>
    <p>Alle weiteren Erkl&auml;rungen beziehen sich auf diesen
    Screen-Shot.</p>
    <p><img src="gelernt.jpg" alt="Screen-Shot"></p>
    <h2>Fenster</h2>
    <p>Das Fenster reagiert so wie alle anderen Programm-Fenster.
    <br>
     Du kannst es Maximieren, Minimieren, Wiederherstellen, Verschieben und
    Schliessen.
    <br>
     Beim Schliessen wirst du gefragt, ob du deine Daten sichern
    m&ouml;chtest. Wenn Du mit &quot;Nein&quot; antwortest, gehen alle
    &Auml;nderungen seit dem Programm-Start verloren.</p>
    <h2>Menu</h2>
    <h3>Datei</h3>
    <h4>Neue Sprache</h4>
    <p>Mit diesem Menupunkt kannst du neue Sprachen zus&auml;tzlich
    aufnehmen. Der Name der Sprache und die Anzahl Abteile werden
    abgefragt, wie beim ersten Mal. Die neue Sprache erscheint sofort in
    der Sprach-Auswahl.</p>
    <h4>Speichern</h4>
    <p>Hiermit kannst du die Daten abspeichern, ohne das Programm zu
    verlassen. Zum Beispiel wenn das Telefon l&auml;utet und du
    bef&uuml;rchten musst, dass in deiner Abwesenheit irgend ein
    Suchthaufen mit einem Game den PC abst&uuml;rzen lassen
    k&ouml;nnte.</p>
    <h4>Beenden</h4>
    <p>Beim Beenden wirst du gefragt, ob du deine Daten sichern
    m&ouml;chtest. Wenn Du mit &quot;Nein&quot; antwortest, gehen alle
    &Auml;nderungen seit dem Programm-Start verloren.</p>
    <h3>Bearbeiten</h3>
    <h4>Lernen</h4>
    <p>Klicke auf diesen Menupunkt, wenn du lernen m&ouml;chtest. Das
    Programm bleibt im Lernmodus, bis du auf einen anderen Modus
    klickst.</p>
    <h4>Eingeben</h4>
    <p>Das Programm geht in den Eingabemodus. Du wirst gefragt welche
    Lektion du eingeben m&ouml;chtest und anschliessend kannst du Vokabeln
    eingeben, bis die Festplatte birst.</p>
    <h4>Suchen und Weitersuchen</h4>
    <p>Passiert dir das auch manchmal, dass du nur noch so ungef&auml;hr
    weisst wie etwas heissen k&ouml;nnte und du kannst es im Buch einfach
    nirgends finden? Da hilft dir der Menupunkt &quot;Suchen&quot;.</p>
    <p>Zum Beispiel du weisst nicht mehr was &quot;ein St&uuml;ck
    Kuchen&quot; auf franz&ouml;sisch heisst.
    <br>
     Du kannst als Suchbegriff &quot;ein St&uuml;ck Kuchen&quot; eingeben
    und das Programm sucht alle Eintr&auml;ge durch und findet &quot;un
    morceau de g&acirc;teau : ein St&uuml;ck Kuchen&quot;, falls du das
    fr&uuml;her mal eingetippt hast.
    <br>
     Du k&ouml;nntest auch einfach nur &quot;Kuchen&quot; eintippen und das
    Programm w&uuml;rde &quot;un g&acirc;teau, des g&acirc;teaux : ein
    Kuchen, Kuchen&quot; finden.
    <br>
     Wenn du nun den Menupunkt &quot;Weitersuchen&quot; aktivierst findet
    das Programm &quot;une tarte : ein Kuchen, eine W&auml;he&quot;.
    <br>
     Nochmals &quot;Weitersuchen&quot; findet &quot;un morceau de
    g&acirc;teau : ein St&uuml;ck Kuchen&quot;.
    <br>
     Nochmals &quot;Weitersuchen&quot; liefert &quot;un moule &agrave;
    g&acirc;teau : Kuchenform&quot;
    <br>
     Nochmals Weitersuchen gibt die Meldung &quot;Nichts (mehr)
    gefunden&quot; zur&uuml;ck.</p>
    <p>Es spielt keine Rolle, ob du den Suchbegriff deutsch oder in der
    Fremdsprache eingibst. Wenn du noch weisst, dass &quot;ein St&uuml;ck
    Kuchen&quot; etwas mit &quot;g&acirc;teau&quot; zu tun hat, kannst du
    als Suchbegriff auch &quot;g&acirc;teau&quot; eingeben.</p>
    <p>Ein Problem gibt es wegen der deutschen Gross- und Kleinschreibung.
    Wenn du &quot;Kuchen&quot; als Suchbegriff eingibst, wird der Eintrag
    &quot;Apfelkuchen&quot; nicht gefunden, weil hier ein kleines
    &quot;k&quot; vorkommt und im Suchbegriff ein grosses &quot;K&quot;.
    <br>
     In diesem Fall kannst du die Suche einmal mit &quot;Kuchen&quot; und
    einmal mit &quot;kuchen&quot; durchf&uuml;hren.
    <br>
     Du k&ouml;nntest aber auch das &quot;k&quot; einfach weglassen und nur
    &quot;uchen&quot; eingeben. Das Programm findet dann &quot;Kuchen&quot;
    und &quot;Apfelkuchen&quot; aber auch &quot;suchen&quot; und
    &quot;fluchen&quot;.</p>
    <p>Du siehst, es braucht nur etwas Fantasie.</p>
    <h4>Abteil-Anzahl</h4>
    <p>Am Anfang (beim neu Anlegen einer Sprache) hast du vielleicht 4
    Abteile (F&auml;cher) gew&auml;hlt. Weil du ein Sprachgenie bist, sind
    aber fast alle Vokabeln im 4. Abteil (Fach) und du suchst eine neue
    Herausforderung. Dann kannst du mit diesem Menupunkt die Abteilanzahl
    erh&ouml;hen und weiterlernen.</p>
    <p>Vielleicht hast du am Anmfang &uuml;berm&uuml;tig 8 Abteile
    gew&auml;hlt und nun stinkt es dir, dass beim kleinsten Fehler das
    K&auml;rtchen mit der Vokabel in das 1. Fach zur&uuml;ckf&auml;llt und
    du es durch alle 8 Abteile wieder durchschleusen musst. Dann kannst du
    mit diesem Menupunkt die Abteilanzahl zum Beispiel auf 5 erniedrigen.
    Alle K&auml;rtchen, der Abteile 6, 7 und 8 werden dabei in Abteil 5
    verschoben.</p>
    <h3>Anzeige</h3>
    <h4>Schrift gr&ouml;sser und Schrift kleiner</h4>
    <p>Passt die Schriftgr&ouml;sse deinen W&uuml;nschen an.</p>
    <h3>Hilfe</h3>
    <h4>Inhalt</h4>
    <p>Ein Hinweis auf die Hilfedatei, die du gerade liest.</p>
    <h4>Widmung</h4>
    <p>Die Widmung in Kurzform.</p>
    <h2>Auswahl</h2>
    <h3>Sprache</h3>
    <p>Klicke auf den Pfeil dieses Pull-Down-Feldes und du siehst alle
    angelegten Sprachen. W&auml;hle die Sprache aus der Liste aus, an der
    du nun arbeiten m&ouml;chtest. Du wirst gefragt, ob du die alten Daten
    vor dem Sprach-Wechsel sichern m&ouml;chtest. Die Vokabeln der neu
    gew&auml;hlten Sprache werden ins Programm geladen und du kannst mit
    der Arbeit beginnen.</p>
    <h3>Abteil-Nummer</h3>
    <p>Die Abteil-Nummer ist nur wichtig beim Lernen. Sie entspricht dem
    Stapel Karteik&auml;rtchen, die du bei der Kartonlernkartei aus einem
    Fach herausnimmst.
    <br>
     Wenn du die Vokabeln in einem Abteil durchnimmst, wird das Abteil
    immer leerer, weil die richtig gewussten ein Abteil weiter wandern. Es
    erscheint eine Meldung, wenn das Abteil leer ist und du kannst an einem
    anderen Abteil weiterarbeiten, indem du auf den Pfeil neben der
    Abteil-Nummer klickst und aus der Liste ein anderes Abteil
    ausw&auml;hlst.
    <br>
     Falls du gerade nur die Vokabeln einer bestimmten Lektion lernst, kann
    diese Leer-Meldung auch kommen, wenn es noch K&auml;rtchen im Abteil
    hat. Hier bedeutet das, dass es f&uuml;r diese ausgew&auml;hlte Lektion
    keine Vokabeln mehr in diesem Abteil gibt.</p>
    <h3>Lektion</h3>
    <p>Normalerweise wirst du alle Vokabeln gleichm&auml;ssig &uuml;ben
    wollen. Wenn du eine Lektion speziell &uuml;ben m&ouml;chtest, kannst
    du in diesem Feld die Lektionsnummer eintippen (mit der
    &quot;ENTER&quot;-Taste best&auml;tigen).
    <br>
     Beim Eingeben von Vokabeln wird die Lektionsnummer automatisch
    umgestellt. Wenn du wieder alle Vokabeln lernen m&ouml;chtest gibst du
    in diesem Feld einfach eine &quot;0&quot; ein.</p>
    <h2>Antwort- und Frage-Feld</h2>
    <p>In diesen Feldern musst du die Vokabeln eintippen: links in der
    Fremdsprache und rechts in Deutsch.
    <br>
     Du kannst auch ganze Redewendungen oder S&auml;tze eingeben. Sie
    d&uuml;rfen auch l&auml;nger als die Eingabefelder sein. Du kannst dann
    mit den Pfeil-Tasten hin und her.
    <br>
     Die Eingaben schliesst du jeweils mit der &quot;ENTER&quot;-Taste ab.
    Beim Lernen bringt ein zweiter Druck auf die &quot;ENTER&quot;-Taste
    die n&auml;chste Frage ins Feld.</p>
    <h2>Falsche Eintr&auml;ge</h2>
    <h3>&Auml;ndern</h3>
    <p>Beim Lernen stellst du fest, dass du einen Tippfehler gemacht hast.
    Ein Klick auf den &quot;&Auml;ndern&quot;-Knopf aktiviert den
    Editier-Modus. Du kannst den Eintrag korrigieren. Schliesse die
    Korrektur mit der &quot;ENTER&quot;-Taste ab.</p>
    <h3>L&ouml;schen</h3>
    <p>Damit kannst du einen Eintrag vollst&auml;ndig l&ouml;schen, so wie
    wenn du das Karteik&auml;rtchen in den Papierkorb wirfst.</p>
    <h3>Suchen</h3>
    <p>Fehlerhafte Eintr&auml;ge verstecken sich und kommen erst auf den
    Bildschirm, wenn die Lehrerin da steht. Wenn du noch weisst, wie der
    Eintrag etwas heissen k&ouml;nnte, kanns du ihn dem Menupunkt
    &quot;Suchen&quot; im Menu &quot;Bearbeiten&quot; finden und
    korrigieren oder l&ouml;schen.</p>
    <h2>Lernerfolgs-Statistik</h2>
    <p>Links siehst du eine gr&uuml;n-gelb-rote S&auml;ule. Sie zeigt dir
    wie gut du heute warst.
    <br>
     Gr&uuml;n : Vokabel auf Anhieb richtig geschrieben (ins n&auml;chste
    Abteil)
    <br>
     Gelb : Vokabel mit Korrektur richtig gewusst (bleibt in diesem Abteil)
    <br>
     Rot : Vokabel leider falsch (wandert zur&uuml;ck ins erste Abteil)</p>
    <p>Im Bild am Seitenanfang siehst du, dass seit dem Programmstart 25
    Abfragen gemacht wurden: 20 waren richtig, 2 mit Korrektur und 3
    falsch.</p>
    <h2>Abteil-Inhalt</h2>
    <p>Rechts siehst du eine gr&uuml;n-blaue S&auml;ule. Sie zeigt wieviele
    K&auml;rtchen in welchem Abteil sind. Links neben der S&auml;ule siehst
    du die Abteil-Nummern und in der S&auml;ule die zugeh&ouml;rige Anzahl
    K&auml;rtchen.
    <br>
     Beim Eingeben kannst du sehen, wie die Anzahl im ersten Abteil
    zunimmt.
    <br>
     Beim Lernen sinkt die Anzahl K&auml;rtchen im ausgew&auml;hlten
    Abteil. F&uuml;r jede richtige Antwort steigt sie im n&auml;chsten
    Abteil und f&uuml;r jede falsche im ersten Abteil.</p>
    <p>Im Bild am Seitenanfang sienst du dass im ersten Abteil 1
    K&auml;tchen liegt, in der zweiten 5, in der dritten 2, in der vierten
    3. Im ganzen sind das 11 K&auml;rtchen.</p>
    <h2>Wie weiter?</h2>
    <p>Wenn du den PC mit anderen teilst, die am gleichen PC Vokabeln
    lernen m&ouml;chten, kannst du das Kapitel <a href=
    "mehrere.html">F&uuml;r mehrere Personen</a> durchsehen.
    <br>
     Falls du schon ganz fleissig tonnenweise Vokabeln eingetippt hast,
    interessiert dich vielleicht, wie du die <a href="sicher.html">Daten
    sichern</a> kannst, bevor der PC abst&uuml;rzt.</p>
    <p>Hier kommst du zur&uuml;ck auf die <a href=
    "Lernkartei.html">Startseite</a> dieser Hilfe.</p>
  </body>
</html>
