<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
		<meta name="keywords" content="Lernkartei, Vokabeltrainer, Fremdsprachen, Redewendungen, Vokabeln">
		<meta name="description" content="Die Lernkartei ist ein kostenlos nutzbarer Vokabeltrainer f&uuml;r Windows, Linux und MAC, der in Java programmiert wurde. Die Lernkartei hilft dir beim &Uuml;ben von Vokabeln und Redewendungen in Fremdsprachen und funktioniert genauso, wie sein Gegenst&uuml;ck aus Karton mit den Karteik&auml;rtchen.">
		<meta name="author" content="Hanspeter Hochreutener">		
    <title>Lernkartei-Hilfe</title>
  </head>
  <body>
    <h1>Lernkartei-Hilfe</h1>
    <img style="float:right; width:50%" src="gelernt.jpg" alt="Lernkartei">
    
    <h2>Inhaltsverzeichnis</h2>
    <p><a href="installieren.html">Installation</a></p>
    <p><a href="start.html">Das erste Mal</a></p>
    <p><a href="bedienen.html">Bedienung</a></p>
    <p><a href="mehrere.html">F&uuml;r mehrere Personen</a></p>
    <p><a href="sicher.html">Daten sichern</a></p>
    <p><a href="hintergrund.html">Andere Hintergrund-Bilder</a></p>
    <p style="float:break">&nbsp;</p>
    <img style="float:left; width:50%" src="lernkartei.jpg" alt=
    "Lernkartei"> 
    <h2>Was ist die Lernkartei?</h2>
    <p>Wenn du eine Fremdsprache lernen m&ouml;chtest, musst du die Worte
    und Redewendungen repetieren, bis sie sitzen.
    <br>
     Dazu kannst du eine Lernkartei benutzen. Du schreibst auf einer
    Karteikarte vorne das Wort in deutsch und hinten in der Fremdsprache.
    Die neuen K&auml;rtchen legst du ins vorderste Fach. Wenn du lernen
    m&ouml;chtest, nimmst du den Stapel K&auml;rtchen aus einem Fach und
    liest die deutsche Seite. Wenn Du das Wort kannst, legst du das
    K&auml;rtchen ins n&auml;chste Fach und wenn du es nicht gewusst hast,
    ins erste Fach.
    <br>
     Das Programm Lernkartei funktioniert genau so. Weil du die Worte
    schreiben musst, ist schummeln schwieriger. Mit Hilfe der integrierten
    Suchfunktion, kann die Lernkartei auch wie ein Lexikon verwendet
    werden.</p>
    <p style="float:break">&nbsp;</p>
    <h2>Wer steckt dahinter?</h2>
    <p>Mein Sohn Raffael &uuml;bt fremdsprachige Vokabeln und Redewendungen
    lieber am PC, als mit der Karton-Lernkartei.
    <br>
     So hatte ich die Idee eine Lernkartei selbst zu programmieren.</p>
    <p>Das ist mein Geschenk f&uuml;r dich, Raffael auf Weihnachten 2001.
    <br>
     Ich w&uuml;nsche dir viel Spass und Erfolg mit den Fremdsprachen.</p>
    <p>Raffael stellt sein Geschenk auch f&uuml;r dich zur Verf&uuml;gung.
    <br>
     Wenn dir das Programm gef&auml;llt oder wenn du Bemerkungen und
    Vorschl&auml;ge machen m&ouml;chtest, schicke doch ein e-Mail an <a
    href="mailto:hrt@zhwin.ch?subject=Lernkartei">hrt@zhwin.ch</a>.</p>
    <h2>Warum JAVA und Open-Source?</h2>
    <p>Monokultur und Monopole sind wie die grauen M&auml;nner in der
    Geschichte von Momo. Sie sind m&auml;chtig und entsetzlich fantasielos.
    Sie haben Geld, aber keine Zeit.</p>
    <p>Wenn es uns gelingt, mit Offenheit und Utopien zu leben, wird die
    Welt vielleicht etwas menschlicher.</p>
    <p>Auch im Software-Bereich gibt es die grauen M&auml;nner, aber auch
    Leute wie Momo.
    <br>
     Es gibt JAVA, das auf allen Rechnern und unter allen Betriebssystemen
    lauff&auml;hig ist.
    <br>
     Es gibt das freie Betriebsystem LINUX, das auch weniger Bemittelten
    den Einsatz von PCs erlaubt.
    <br>
     Es gibt Leute, die f&uuml;r sich Programme schreiben und sie kostenlos
    anderen zur Verf&uuml;gung stellen.
    <br>
     Es gibt Leute, die den Quellcode ihrer Programme f&uuml;r die
    Weiter-Entwicklung ver&ouml;ffentlichen.</p>
    <p>Pers&ouml;nlich habe ich diesen Leuten viel zu verdanken und
    m&ouml;chte mich revanchieren.
    <br>
     Deshalb habe ich dieses Programm in JAVA geschrieben.
    <br>
     Ich stelle den Quellcode unter der GNU-Public-Licence (GPL) allen zur
    Verf&uuml;gung.
    <br>
     Und ich habe die Hilfestellung in firmenunabh&auml;ngigem HTML
    geschrieben.</p>
  </body>
</html>
