<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
		<meta name="keywords" content="Lernkartei, Vokabeltrainer, Fremdsprachen, Redewendungen, Vokabeln">
		<meta name="description" content="Die Lernkartei ist ein kostenlos nutzbarer Vokabeltrainer f&uuml;r Windows, Linux und MAC, der in Java programmiert wurde. Die Lernkartei hilft dir beim &Uuml;ben von Vokabeln und Redewendungen in Fremdsprachen und funktioniert genauso, wie sein Gegenst&uuml;ck aus Karton mit den Karteik&auml;rtchen.">
		<meta name="author" content="Hanspeter Hochreutener">		
    <title>Lernkartei-Hilfe</title>
  </head>

  <body>
    <h1>Lernkartei - Das erste Mal</h1>
    <h2>Was ist eine Lernkartei?</h2>
    <p><img src="lernkartei.jpg" alt="Lernkartei"></p>
    <p>Wenn du eine Fremdsprache lernen m&ouml;chtest, musst du die Worte
    immer wieder repetieren, bis sie sitzen.
    <br>
     Das kannst du machen, indem du im Buch mit einem Blatt eine Spalte
    abdeckst. Der Nachteil dieser Methode ist, dass du dir eine Reihenfolge
    merkst und auch dass du die Worte, die du schon beherrscht ebenfalls
    repetieren musst.
    <br>
     Die Lernkartei schafft Abhilfe. Du schreibst auf einer Karteikarte
    vorne das Wort in deutsch und hinten in der Fremdsprache. Die neu
    geschreibenen K&auml;rtchen legst du in das vorderste Fach. Wenn du
    lernen m&ouml;chtest nimmst du den Stapel K&auml;rtchen aus dem
    vordersten Fach und liest die deutsche Seite. Wenn Du das Wort kannst,
    legst du das K&auml;rtchen ins n&auml;chste Fach und wenn du es nicht
    gewusst hast, in das erste Fach. Wenn das erste Fach leer ist, nimmst
    Du den Stapel aus den zweiten Fach. K&auml;rtchen die du kannst legst
    du ins dritte Fach und die anderen zur&uuml;ck ins erste Fach. usw.</p>
    <h2>Was macht das Programm Lernkartei?</h2>
    <p>Es funktioniert genau so wie sein Vorbild aus Karton. Es hat ein
    paar Vorteile:</p>
    <ul>
      <li>du musst die Worte schreiben, nicht nur denken</li>
      <li>du bekommst ein zweite Chance, wenn du Fehler machst</li>
    </ul>
    <p>und ein Nachteile:</p>
    <ul>
      <li>du kannst den PC nicht in die Schule und auf Reisen
      mitnehmen</li>
      <li>der PC ist vielleicht h&auml;ufig von anderen besetzt</li>
    </ul>
    <h2>Wie starte ich das erste Mal?</h2>
    <p>Du klickst auf die Verkn&uuml;pfung auf dem Desktop oder im
    Start-Menu und das Programm startet.
    <br>
     Weil du noch keine &quot;Karteik&auml;rtchen&quot; eingegeben hast und
    das Programm nicht wissen kann, welche Sprache Du lernen m&ouml;chtest,
    kommt als erstes dieses Fenster:
    <br>
     <img src="sprache.jpg" alt="Sprache ausw&auml;hlen">
    <br>
     Du tippst einfach die Sprache ein und dr&uuml;ckst am Schluss die
    &quot;ENTER&quot;-Taste (das ist die grosse Taste rechts).</p>
    <p>Nun m&ouml;chte das Programm wissen, wieviele Abteile (oder
    Kartei-F&auml;cher) du anlegen m&ouml;chtest.
    <br>
     <img src="abteil.jpg" alt="Abteil-Anzahl ausw&auml;hlen">
    <br>
     Du kannst mit der &quot;ENTER&quot;-Taste den eingestellten Wert
    &uuml;bernehmen.</p>
    <p>Nun erscheint das Programm in einem normalen Fenster.
    <br>
     <img src="neu.jpg" alt="Programm-Neustart"></p>
    <h2>Vokabeln eingeben</h2>
    <p>Bevor du mit Lernen beginnen kannst, musst du die Worte auf die
    Karteikarte schreiben. Entschuldigung ich meine in den PC eintippen.
    Dazu w&auml;hlst du im Menu &quot;Bearbeiten&quot; den Punkt
    &quot;Eingeben&quot;.
    <br>
     <img src="eingeben.jpg" alt="Menu-Eingeben"></p>
    <p>Und schon wieder m&ouml;chte der PC etwas von dir wissen.
    N&auml;mlich welche Lektion du eintippen m&ouml;chtest.
    <br>
     <img src="lektion.jpg" alt="Lektion-Eingeben">
    <br>
     Das ist n&uuml;tzlich, weil du so sp&auml;ter zum Beispiel nur die
    Vokabeln der Lektion 6 repetieren kannst.</p>
    <p>Nun kannst Du die Worte so eintippen, wie sie im Buch stehen: im
    linken Feld in der Fremdsprache (&quot;ENTER&quot;-Taste nicht
    vergessen) und im rechten Feld das deutsche Wort
    (&quot;ENTER&quot;-Taste nicht vergessen).
    <br>
     <img src="eingegeben.jpg" alt="Eingabe-Felder">
    <br>
     Am Balken auf der rechten Bildseite siehst du wieviele Worte du schon
    eingetippt hast.</p>
    <h2>Vokabeln lernen</h2>
    <p>Es gilt ernst. Du wirst staunen, wieviel du beim Eintippen schon
    gelernt hast. W&auml;hle im Menu &quot;Bearbeiten&quot; den Punkt
    &quot;Lernen&quot;.
    <br>
     <img src="lernen.jpg" alt="Menu-Lernen"></p>
    <p>Auf der rechten Seite erscheint das deutsche Wort, du musst das Wort
    in der Fremdsprache im linken Feld eintippen (&quot;ENTER&quot;-Taste
    nicht vergessen).
    <br>
     <img src="gelernt.jpg" alt="Lern-Erfolg"></p>
    <p>Wenn das Wort richtig ist, erscheint es gr&uuml;n (= gut) unterlegt.
    Die Erfolgsstatistik auf der linken Seite z&auml;hlt bei
    &quot;gr&uuml;n&quot; eins dazu. Auf der rechten Seite siehst Du wie
    das K&auml;rtchen ein Abteil weiterwandert. Mit &quot;ENTER&quot; geht
    es weiter zum n&auml;chsten Wort.
    <br>
     Wenn das Wort falsch ist, erscheint es blau (= du hast noch eine
    Chance) unterlegt. Dort wo die Buchstaben falsch sind, siehst du einen
    &quot;*&quot;. Korrigiere die &quot;*&quot; mit den richtigen
    Buchstaben und dr&uuml;cke die &quot;ENTER&quot;-Taste.
    <br>
     Wenn das Wort jetzt richtig ist, erscheint es gelb (= also doch
    gewusst) unterlegt. Auf der linken Seite kommt bei &quot;gelb&quot;
    eins dazu. Das K&auml;rtchen bleibt im gleichen Abteil liegen.
    <br>
     Wenn es nochmals falsch war, siehst du rot (= das sitzt noch nicht).
    &quot;rot&quot; wird um eins erh&ouml;ht und das K&auml;rtchen kommt in
    das erste Abteil.</p>
    <h2>Hilfe das Abteil ist leer</h2>
    <p>Wenn du alles gekonnt hast, sind alle K&auml;rtchen ein Abteil
    weiter gewandert und das Abteil ist leer.
    <br>
     <img src="keineintrag.jpg" alt="Abteil ist leer">
    <br>
     Wenn diese Medlung erscheint, musst du das Abteil wechseln und es geht
    mit dem n&auml;chsten Abteil weiter.
    <br>
     <img src="abteilwechseln.jpg" alt="Abteil oder Lektion wechseln">
    <br>
     Wenn du nur eine bestimmte Lektion gelernt hast, kann die Meldung auch
    dann kommen, wenn das Abteil nicht leer ist, also wenn es einfach von
    dieser Lektion keine K&auml;rtchen mehr hat. In diesem Fall
    &auml;nderst du die Zahl bei der Lektion (0 = alle Lektionen lernen)
    und dr&uuml;ckst &quot;ENTER&quot;.</p>
    <h2>Speichern und Beenden</h2>
    <p>Wenn du genug gelernt hast, kannst du das Programm mit dem Menu
    &quot;Datei&quot; und dem Punkt &quot;Beenden&quot; schliessen. Das
    Programm fr&auml;gt, ob du die eingetippten und gelernten K&auml;rtchen
    speichern m&ouml;chtest. Wenn du &quot;Nein&quot; w&auml;hlst, gehen
    alle Eingaben und &Auml;nderungen verloren.
    <br>
     <img src="beenden.jpg" alt="beenden"></p>
    <h2>Wie weiter?</h2>
    <p>Wenn du Lust hast, kannst du das Kapitel <a href=
    "bedienen.html">Bedienung</a> durchsehen, wo weitere Details
    werden.</p>
    <p>Hier kommst du zur&uuml;ck auf die <a href=
    "Lernkartei.html">Startseite</a> dieser Hilfe.</p>
  </body>
</html>
